# 44: Menata ulang penempatan kolom pada Data Frame

"Enjelita Meilinda - 2373037"
# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  8  7  9  1
1  5  9  2  8  1
2  9  4  7  8  7
3  1  1  1  9  9
4  4  6  1  5  8

# Menata ulang penempatan kolom pada Data Frame

In [3]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  9  7  5  1  8
1  8  2  5  1  9
2  8  7  9  7  4
3  9  1  1  9  1
4  5  1  4  8  6

In [4]:
df

   A  B  C  D  E
0  5  8  7  9  1
1  5  9  2  8  1
2  9  4  7  8  7
3  1  1  1  9  9
4  4  6  1  5  8

In [5]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  9  7  5  1  8
1  8  2  5  1  9
2  8  7  9  7  4
3  9  1  1  9  1
4  5  1  4  8  6